[
    {
        "name": "Daisy G",
        "verified": true,
        "date": "09/21/2023",
        "review": "The test was easy to complete and mail. After my results were done the guy who I spoke with was very helpful in explaining my results and how to proceed.",
        "recommend": "Would recommend to a friend",
        "rating": 5
    },
    {
        "name": "Bonnie R",
        "verified": true,
        "date": "08/30/2023",
        "review": "Customer care is nothing short of amazing. If you're in doubt on this purchase, don't be. I waited far too long and was relieved after three years of being really sick, I have a starting point. I highly recommend for anyone suffering from unusual symptoms that PCP or even ID can't figure out. These guys did the job right.",
        "recommend": "Would recommend to a friend",
        "rating": 5
    },
    {
        "name": "Alethea J",
        "verified": true,
        "date": "07/17/2023",
        "review": "The test was very thorough and the customer service was superb! Evan responded to all of my inquiries in a timely manner and took the time to explain all of my results to me. I did a lot of research on finding the best home test kit and I know this one was on the pricier side but it was worth it. No other testing kits were as thorough and educational as this one. Not even a doctor takes the time to be this thorough! It was worth every dollar spent to get peace of mind about my health. Knowing about parasites, candida, and other gut health challenges is a major step in self-care.",
        "recommend": "Would recommend to a friend",
        "rating": 5
    },
    {
        "name": "Kimberley L",
        "verified": true,
        "date": "02/17/2023",
        "review": "I was extremely pleased with the quick turnaround time and the comprehensive, detailed results I received, but what impressed me most was Evan’s attentiveness and personal replies to my emails. It's rare these days to be able to actually speak to, or to be able to communicate with, a “real person” instead of an automated answering service, and the personal touch is so greatly appreciated! Thank you, Evan, for being available, communicative, friendly, and especially, so knowledgeable, about your work!",
        "recommend": "Would recommend to a friend",
        "rating": 5
    },
    {
        "name": "Arabella A",
        "verified": true,
        "date": "01/20/2023",
        "review": "Overall simplified process in ordering kit, collecting sample, and returning the samples. The team was available to respond to questions, and the follow up to review the report was super helpful. I feel like I have an understanding what next steps to take, and how I can be mindful in my approach to better gut health.",
        "recommend": "Would recommend to a friend",
        "rating": 5
    },
    {
        "name": "Chad H",
        "verified": true,
        "date": "01/14/2023",
        "review": "5 star rating and I would highly recommend you guys! A very easy way to test from home! Ezpz!",
        "recommend": "Would recommend to a friend",
        "rating": 5
    },
    {
        "name": "Mary A",
        "verified": true,
        "date": "07/20/2022",
        "review": "I would rate this company five stars and I would definitely recommend them to my friends. The test was very easy to do and very hygienic. When I called to have the results explained Evan was very helpful and informative. This is a great service and a great company!!",
        "recommend": "Would recommend to a friend",
        "rating": 5
    },
    {
        "name": "Wanda L",
        "verified": true,
        "date": "07/19/2022",
        "review": "Yes I would recommend. Fast service. Answered all my phone calls and emails quickly. Is a very caring person.",
        "recommend": "Would recommend to a friend",
        "rating": 5
    },
    {
        "name": "Angela G",
        "verified": true,
        "date": "06/30/2022",
        "review": "Evan was very helpful, informative and responsive from the beginning. He was directly available via phone to explain my test results and went above and beyond in answering all of my questions. I really appreciate the time and effort taken to go over my options, once I received my results. I would highly recommend to anyone looking for an easy to follow, thorough, knowledgeable and professional experience, as well as solutions offered for something as important as your health.",
        "recommend": "Would recommend to a friend",
        "rating": 5
    },
    {
        "name": "Holly S",
        "verified": true,
        "date": "06/28/2022",
        "review": "Evan gave very personalized service to help me understand my test results. It’s obvious he has a passion for helping others become healthier versions of themselves.",
        "recommend": "Would recommend to a friend",
        "rating": 5
    },
    {
        "name": "Crystal B",
        "verified": true,
        "date": "09/21/2023",
        "review": "Evan was very knowledgeable and helpful! We discussed everything I could think of I know I can reach out with any future questions, which is great!",
        "recommend": "Would recommend to a friend",
        "rating": 5
    },
    {
        "name": "Amy M",
        "verified": true,
        "date": "05/31/2022",
        "review": "Evan was so knowledgeable and helpful with understanding what my results meant and even recommended somethings that could help improve my health. I highly recommend.",
        "recommend": "Would recommend to a friend",
        "rating": 5
    },
    {
        "name": "Tamara W",
        "verified": true,
        "date": "05/24/2022",
        "review": "Evan went above and beyond answering all my questions. I would highly recommend!",
        "recommend": "Would recommend to a friend",
        "rating": 5
    },
    {
        "name": "Kristin W",
        "verified": true,
        "date": "05/17/2022",
        "review": "I love how easy it was working with the lab and getting my results. I got my results back fast and it was very thorough! included details of everything along with photos. The follow up with Evan was great too. Fast communication by phone and email anytime I had any questions. I was recommended by a friend for it being a trusted lab and in my experience I can say the same. I will be a returning customer for sure !",
        "recommend": "Would recommend to a friend",
        "rating": 5
    },
    {
        "name": "N B",
        "verified": true,
        "date": "03/10/2022",
        "review": "I've had many medical problems and your test brought me some insight on what is going on in my body. Thank you so very much! Great service too.",
        "recommend": "Would recommend to a friend",
        "rating": 5
    },
    {
        "name": "E D",
        "verified": true,
        "date": "02/20/2022",
        "review": "Evan is extremely professional and took the time to ask me about my symptoms. I felt very comfortable talking to him about some embarrassing symptoms. I got my test results back promptly and he took the time to go over them in detail with recommendations. I would highly recommend to anyone experiencing symptoms that may be related to a parasite to contact Evan at Parasites.org Thank you, E.D.",
        "recommend": "Would recommend to a friend",
        "rating": 5
    },
    {
        "name": "Michele M",
        "verified": true,
        "date": "02/03/2022",
        "review": "I found parasites.org after searching online for a parasite kit that tested for more than just Candida. I had done a holistic parasite cleanse prior to testing and decided after the cleanse that I needed to check for parasites since my symptoms didn't completely go away. I was wavering between thinking I had leaky gut or recurrent parasites, and I wanted more insight into what was actually in my gut. I wish now I would have tested first, then done the cleanse so I would have had a baseline to go off of.<br><br>Pros: The parasite kit arrived quickly after ordering it online and was easy to use. It came with clear instructions along with tips on how to get the best sample(s). Evan followed up, as promised, with a personal phone call to go over the test results and gave me some suggestions on what I could do to help my symptoms. Evan provided excellent customer service, I did not feel hurried on our phone call, and he offered a discount on further purchases.<br><br>Cons: I am accustomed to getting email updates on online purchases. I was disappointed that I did not get an email confirmation after the purchase, when my sample was received, or to notify that my sample was in the process of being assessed. I was nervous that the test kit was actually fake and that my sample was not received or being tested.<br>Overall, I was happy I invested in this test kit and would recommend it to anyone wanting a starting point for bothersome symptoms or periodically wanting to test/re-test. Evan has a passion for helping others understand parasites and his company is a great resource!",
        "recommend": "Would recommend to a friend",
        "rating": 5
    },
    {
        "name": "Tara C",
        "verified": true,
        "date": "01/19/2022",
        "review": "I would rate the at home parasite testing company Parasites.org, a 6 out of 6 stars. I would go higher if I could and would definitely recommend their services to friends. As someone who does not like big corporations or even going to the Dr., I was shocked to experience easy, fast, thorough, friendly, and personalized service. Ordering the kit, providing a sample, and sending it back was very simple and discreet and was not complicating or time consuming like I had expected. Every question I emailed was quickly responded to and I received the results with a couple of days.<br><br>The results were explained in detail as well as personalized plan informing me of the best course of action to take that would help to remedy my situation. The plan was way more than I expected to get from a lab giving you test results because most places just tell you to go to the Dr and that's the extent of their advice. Parasites.org sets the bar on how a professional health service should conduct their business.",
        "recommend": "Would recommend to a friend",
        "rating": 5
    },
    {
        "name": "Sue S",
        "verified": true,
        "date": "01/06/2022",
        "review": "Thoughts on the experience: It was easy to do. I eliminated dark foods for one week to make it easier to identify the organisms as the directions suggested. Then I did four samples over four days during the full moon when parasites are said to reproduce and be more active. The directions and supplies were sufficient for the task. I had the results one week later! Evan thoroughly explained the findings and answered all my questions. And, because Evan provides this service I was able to share my results with my doctor and have a stool bacterial culture test ordered. I was also able to contact a doctor in my area with 40 years working with Immunology-Infectious Diseases and shared the results with him. I will hear from him next week once he has the results from the bacteria test. Thank you, Evan, for seeing a need and filling it! I greatly appreciate you, your knowledge and your commitment to helping people become healthy! Sincerely, Sue S.",
        "recommend": "Would recommend to a friend",
        "rating": 5
    },
    {
        "name": "Kim W",
        "verified": true,
        "date": "01/04/2022",
        "review": "Great personal touch and care. I appreciate customer service answering questions about my test.",
        "recommend": "Would recommend to a friend",
        "rating": 5
    },
    {
        "name": "Andrea S",
        "verified": true,
        "date": "12/31/2021",
        "review": "The kit arrived very quickly with easy instructions and a return label that was easy to return shipping. My results came in the amount of time the website had informed me and I received a phone call from Evan with my results along with an email of my results to show my doctor. Evan was very helpful and answered all my questions and was very informative about my test results. He has answered all my emails and questions I have about my test.<br><br>I'm very impressed with this service and would recommend this website to anyone trying to get testing done. I would rate this a 5 Star service.",
        "recommend": "Would recommend to a friend",
        "rating": 5
    },
    {
        "name": "Jen S",
        "verified": true,
        "date": "03/12/2024",
        "review": "Parasites.org is a great company to work with. Evan is very knowledgable and was helpful in selecting the appropriate test kit, as well as, understanding how to read the lab result. Highly recommend.",
        "recommend": "Would recommend to a friend",
        "rating": 5
    },
    {
        "name": "Angel S",
        "verified": true,
        "date": "03/15/2024",
        "review": "I wanted the most thorough and at home test for the parasites since my doctor did not believe me. This test helped me diagnose what was making me sick. I got personal service also. The owner helped with any questions or problems I had. And let me know my results with recommendations.",
        "recommend": "Would recommend to a friend",
        "rating": 5
    },
    {
        "name": "Tony S",
        "verified": true,
        "date": "03/19/2024",
        "review": "Great test, would recommend.",
        "recommend": "Would recommend to a friend",
        "rating": 5
    },
    {
        "name": "Gina A",
        "verified": true,
        "date": "01/09/2024",
        "review": "Evan is quite possibly one of the most knowledgeable and personable people I've ever dealt with in regards to my health. The test itself is so easy and the way he designed his company really stands above most testing laboratories. The test is broken down in easy to digest information. He answers any questions and runs his business the old fashioned way- by actually communicating with his customers. Truly a fantastic guy- calm, smart, positive and scientific. He made me feel so much better about my health! Love the guy!",
        "recommend": "Would recommend to a friend",
        "rating": 5
    },
    {
        "name": "Danielle K",
        "verified": true,
        "date": "12/20/2023",
        "review": "I appreciate the efficiency, affordability, and thoroughness of Parasites.org testing. My digestion has been off and has taken a toll on my health, mood, and energy. I wanted to get a better idea of what I’m dealing with, and this test seemed more comprehensive and cheaper than testing at my doctor’s office. \nThe service surpassed my expectations because the test kit arrived quickly and was easy to complete, and my results were back early! When I called Evan with follow-up questions, he was extremely helpful. \nHaving this information is empowering because I have more clarity in making changes in my diet. I recommend this service highly!",
        "recommend": "Would recommend to a friend",
        "rating": 5
    }
]